## Production: route53
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to move, 1 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                              NAME                                               |
|--------|-------------------------------------------------------------------------------------------------|
| add    | `aws_acm_certificate.cra_upd_loadbalancer_acm`                                                  |
| delete | `aws_acm_certificate.cra_upd_cloudfront_acm[0]`                                                 |
|        | `aws_route53_record.cra_upd_cloudfront_cert_validation_record[&quot;*.prod.cra-arc.cdssandbox.xyz&quot;]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_acm_certificate.cra_upd_cloudfront_acm[0] will be destroyed
  # (because index [0] is out of range for count)
  # (moved from aws_acm_certificate.cra_upd_cloudfront_acm)
  - resource "aws_acm_certificate" "cra_upd_cloudfront_acm" {
      - arn                       = "arn:aws:acm:us-east-1:480754269604:certificate/88c0deca-1932-4c55-af02-f7cfdbbb494c" -> null
      - domain_name               = "prod.cra-arc.cdssandbox.xyz" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "*.prod.cra-arc.cdssandbox.xyz"
              - resource_record_name  = "_779cbf2f0fcb2e831983d920439264ed.prod.cra-arc.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_0604cd777babbbfe5dc82ad73f7c7b09.jkddzztszm.acm-validations.aws."
            },
          - {
              - domain_name           = "prod.cra-arc.cdssandbox.xyz"
              - resource_record_name  = "_779cbf2f0fcb2e831983d920439264ed.prod.cra-arc.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_0604cd777babbbfe5dc82ad73f7c7b09.jkddzztszm.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:us-east-1:480754269604:certificate/88c0deca-1932-4c55-af02-f7cfdbbb494c" -> null
      - key_algorithm             = "RSA_2048" -> null
      - pending_renewal           = false -> null
      - renewal_eligibility       = "INELIGIBLE" -> null
      - renewal_summary           = [] -> null
      - status                    = "PENDING_VALIDATION" -> null
      - subject_alternative_names = [
          - "*.prod.cra-arc.cdssandbox.xyz",
          - "prod.cra-arc.cdssandbox.xyz",
        ] -> null
      - tags_all                  = {
          - "CostCentre"  = "cra-upd-dashboard"
          - "Environment" = "production"
          - "Terraform"   = "true"
        } -> null
      - type                      = "AMAZON_ISSUED" -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null
        # (4 unchanged attributes hidden)

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_acm_certificate.cra_upd_loadbalancer_acm will be created
  + resource "aws_acm_certificate" "cra_upd_loadbalancer_acm" {
      + arn                       = (known after apply)
      + domain_name               = "prod.cra-arc.cdssandbox.xyz"
      + domain_validation_options = [
          + {
              + domain_name           = "*.prod.cra-arc.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "prod.cra-arc.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.prod.cra-arc.cdssandbox.xyz",
          + "prod.cra-arc.cdssandbox.xyz",
        ]
      + tags_all                  = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "production"
          + "Terraform"   = "true"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # aws_route53_record.cra_upd_cloudfront_cert_validation_record["*.prod.cra-arc.cdssandbox.xyz"] will be destroyed
  # (because key ["*.prod.cra-arc.cdssandbox.xyz"] is not in for_each map)
  - resource "aws_route53_record" "cra_upd_cloudfront_cert_validation_record" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_779cbf2f0fcb2e831983d920439264ed.prod.cra-arc.cdssandbox.xyz" -> null
      - id                               = "Z05607493B4ZBS93T8KU0__779cbf2f0fcb2e831983d920439264ed.prod.cra-arc.cdssandbox.xyz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_779cbf2f0fcb2e831983d920439264ed.prod.cra-arc.cdssandbox.xyz" -> null
      - records                          = [
          - "_0604cd777babbbfe5dc82ad73f7c7b09.jkddzztszm.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z05607493B4ZBS93T8KU0" -> null
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  - cloudfront_certificate_arn   = "arn:aws:acm:us-east-1:480754269604:certificate/88c0deca-1932-4c55-af02-f7cfdbbb494c" -> null
  + loadbalancer_certificate_arn = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.cra_upd_loadbalancer_acm"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.cra_upd_hosted_zone"]

21 tests, 19 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
